meeting/minutes/2023/03-07.org
:PROPERTIES:
:ID:       978EA388-783A-4C26-830C-9DFF9028021A
:END:
#+title: QT4 CG Meeting 025 Minutes 2023-03-07
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

* Draft Minutes
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: minutes
:END:

* Summary of new and continuing actions [0/10]
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: new-actions
:END:

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-016-08: RD to clarify how namespace comparisons are performed.
+ [ ] QT4CG-023-01: NW to review the stylesheets for functions across XPath and XSLT
+ [ ] QT4CG-023-05: NW to put record types on an agenda.
+ [ ] QT4CG-024-01: MK to add namespace-uri-for-prefix argument changes to the compatibility appendix
+ [ ] QT4CG-024-02: DN to develop an alternative proposal for deep-action.
+ [ ] QT4CG-025-01: NW to close the issues we agreed to close in meeting 024
+ [ ] QT4CG-025-02: MK to make the context function properties simple values instead of functions
+ [ ] QT4CG-025-03: MK to revise and expand technical detail in PR #375
+ [ ] QT4CG-025-04: RD to remove the note in 15.5.15 of functions and operators.
+ [ ] QT4CG-025-05: MK to correct the accidental deletion in 3.6.2 of XQuery
+ [ ] QT4CG-025-06: NW to fix the “blue boxes” in the serialization specification
+ [ ] QT4CG-025-07: MK to update the text about for/let changes to use use definitions and termrefs correctly.
+ [ ] QT4CG-025-08: MK to add an error code for the case where =member= is used on something that isn’t an array
+ [ ] QT4CG-025-09: NW to add the parse-uri and build-uri tests to the test suite

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call [9/12]
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

Regrets: BTW, DN

+ [ ] Anthony (Tony) Bufort (AB)
+ [X] Reece Dunn (RD)
+ [X] Sasha Firsov (SF)
+ [X] Christian Grün (CG)
+ [X] Joel Kalvesmaki (JK) [:15-]
+ [X] Michael Kay (MK)
+ [X] John Lumley (JL)
+ [ ] Dimitre Novatchev (DN)
+ [X] Ed Porter (EP)
+ [X] C. M. Sperberg-McQueen (MSM) [:08-]
+ [ ] Bethan Tovey-Walsh (BTW)
+ [X] Norm Tovey-Walsh (NW). /Scribe/. /Chair/.

** Accept the agenda
:PROPERTIES:
:CUSTOM_ID: agenda
:END:

Proposal: Accept [[../../agenda/2023/03-07.html][the agenda]].

Accepted.

** Approve minutes of the previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Proposal: Accept [[../../minutes/2023/02-28.html][the minutes of the previous meeting]].

+ MK: First item was a discussion on closing various issues. I believe
  we agreed to close some but didn’t make an action.

ACTION QT4CG-025-01: NW to close the issues we agreed to close in meeting 024

+ RD: Should be able to close the parse HTML issue as well.
+ MK: If you opened an issue and you think it can now be closed, I
  think go ahead and close it.

Accepted as amended.

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

The next meeting [[../../agenda/2023/03-14.html][is scheduled for Tuesday, 14 March 2023]].

ATTENTION: This meeting is scheduled at 16:00 local time in Europe.
The United States will be on Daylight Saving Time starting on Sunday,
12 March 2023. Until Europe and the UK switch to summer time (on 26
March 2023), this meeting will be one hour *later* in the United
States starting *next week*.

No regrets heard.

** Review of open action items [1/7]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-016-08: RD to clarify how namespace comparisons are performed.
+ [ ] QT4CG-023-01: NW to review the stylesheets for functions across XPath and XSLT
+ [ ] QT4CG-023-05: NW to put record types on an agenda.
+ [ ] QT4CG-024-01: MK to add namespace-uri-for-prefix argument changes to the compatibility appendix
+ [ ] QT4CG-024-02: DN to develop an alternative proposal for deep-action.
+ [X] QT4CG-024-03: NW to create issues for improving fn:deep-equal

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

Last week, the suggestion was made that we try to clear up a bit of
the back log in PRs by reviewing some of the smaller, simpler ones.
Please read these issues in preparation for the meeting so that we are
more likely to be able to move through them swiftly.

