meeting/minutes/2023/03-07.org
** PR #375: Context for default parameter values
:PROPERTIES:
:CUSTOM_ID: h-074E7C57-5C3A-4FA8-AF9E-EAFE0F504864
:END:

Contrary to the remark above, this /is not/ a small issue. But it’s a
bug and deseves high priority. I propose a 30 minute time box on this
issue so that we do have time to resolve some low hanging fruit.

See [[https://qt4cg.org/dashboard/#pr-375][pull request #375]].

+ MK: I worked through all the changes in XQuery, but haven’t done the
  corresponding changes on XSLT. If we agree with the design, it’s
  fairly mechanical to translate to XSLT.
  + … In the course of doing this, I found that the two sections on
    variable and function declarations had become unstructured and
    unweildy. I reorganized them but that makes the diff hard to read.
  + … What should be the static and dynamic context for the expression
    that defines a default value?
  + … Using the same static context as variable declarations fails to
    satisfy the goal of allowing user-defined functions to have access
    to the context item and default collation.
  + … First thought was to use something different for the dynamic
    context, but that makes the inconsistent. The “static item context
    type” for example becomes meaningless if the context item is taken
    from the dynamic context.
  + … I thought about defining a custom context, we could do that, but
    it’s a little bit daunting.
  + … I also thought about cutting back on our ambitions and allowing
    only the static context. That’d lose the ability to use the
    context.
  + … The proposal here introduces a new function that you can call in
    the initializing expression that give you access to parts of the
    callers context.
  + … I’m not enormously fond of the solution, but…
+ RD: As a goal, I think it’s a good to make it possible to get to the
  dynamic context.
+ CG: I think that it would be good to add an example of a function
  item. I outlined it in a comment on issue #375.

#+BEGIN_SRC
let $filter := function(
  $item := caller-context()?context-item()
) {
  $item = 'Jupiter'
}
return //planet[$filter()]
#+END_SRC

+ MK: Adding examples is part of the next phase if the design is accepted.
+ CG: Can we call the function =context()= and the item =item=?
+ MK: When we get to talking about the spelling, you’re in the home stretch.
+ JL: Couldn’t this be generalized to solve questions like “what’s my
  current mode” in XSLT?
+ MK: Yes. I adopted a fairly extensible design on purpose.
+ JL: Would we also have to be fairly careful about security
  implications? About being able to see things that the compiler has
  got rid of.
+ MK: For access to the static context, that could be an issue. It’s
  nice to be able to discard parts of that.
+ RD: In the current spec, where we’ve done =.= for the context, all
  of those will need updating.
+ MK: Yes, if we do this, we’ll have to update the standard functions.

MK isn’t sure that it makes sense to attempt to go through in too much
detail. Reviews the non-diff version because of the changes caused by
reorganizing things into subsections.

+ MK: Most of the change is in 5.18.1…
+ JL: Why are the record types functions rather than just values?
+ MK: Probably to emphasize that you expect them to be evaluated
  lazily; that’s probably particularly true of =last()=.
  + … We could leave out the brackets and make them properties rather than
    methods.
+ CG: One advantage of a simple map is that it makes it clear that the
  values you get are specific to when the function was called.
+ RD: I’m in favor of them being ordinary variables.

ACTION QT4CG-025-02: MK to make the context function properties simple values instead of functions

+ MK: I think we’re looking for agreement in principle.
+ CG: The =$= character needs to be removed
+ MK: Yes, that’s a typo.
+ JL: In XSLT, we have a parallel where it’s a variable (in catches
  and things).
+ MK: Yes, we define magic variables there. There are other places
  where we define magic functions.
+ RD: XQuery does the same thing for variables in the catch expression.
+ MK: If it’s a magic variable, what namespace does it have to be in?
+ NW: We can leave it a function and not have to answer that question!
+ CG: A function also makes it clear that it changes when called in different places.
+ JL: Can you bind it to a variable?
+ MK: Yes, but the scope is going to be in your initializer so it can’t escape.

Proposal: accept this PR in principle, action to MK to expand it

Accepted.

ACTION QT4CG-025-03: MK to revise and expand technical detail in PR #375

** PR #378: Update the localName and unparsed entity reference notes for parse-html
:PROPERTIES:
:CUSTOM_ID: h-7AC1783C-19E6-4163-8BE0-236FBABFE76E
:END:

See [[https://qt4cg.org/dashboard/#pr-378][pull request #378]].

+ RD: This is a straightforward change; I’ve changed “must” to “will”
  in various cases where we’re referring to ASCII lower case and
  changed “unparsed” to “unknown”.

Some discussion of the “unparsed-entity-public-id” accessor. It’s not
relevant because HTML5 doesn’t have unparsed entities.

ACTION QT4CG-025-04: RD to remove the note in 15.5.15 of functions and operators.

Proposal: Accept as ammended?

Accepted.

** PR #371: Issue 370: forwards and backwards compatibility for 4.0
:PROPERTIES:
:CUSTOM_ID: h-EDC3E35B-2AD7-4E6F-B92D-4369CF84D8DC
:END:

See [[https://qt4cg.org/dashboard/#pr-371][pull request #371]].

+ MK: This was editorially updating some things to say 4.0 instead of 3.0.

Proposal: Accept this PR?

Accepted.

** PR #364: Generalize switch expressions in XQuery
:PROPERTIES:
:CUSTOM_ID: pr364
:END:

See [[https://qt4cg.org/dashboard/#pr-364][pull request #364]].

+ CG talks us through the changes to the switch expression.
  + … In the new version you can supply arbitrary lists of expressions
    in the switch expressions. If any expression matches, then the
    case is accepted. If it’s an empty expression it works as before.

Proposal: Accept this PR?

Accepted.

** PR #363: Issue 345; missing rules for type matching
:PROPERTIES:
:CUSTOM_ID: pr363
:END:

See [[https://qt4cg.org/dashboard/#pr-363][pull request #363]].

+ MK: This was a fairly obvious omission. I’ve added a few notes and
  clarified what schema types are.
  + … Local union type and enumeration types are “schema types”
  + … etc.

ACTION QT4CG-025-05: MK to correct the accidental deletion in 3.6.2 of XQuery

+ MK: The new rule in 3.6.2 is what was missing.
  + … The rest is expanding on the definitions and editorial improvements.

Proposal: Accept this PR as amended?

Accepted.


** PR #355: Add to imp-defined-feature-appendix
:PROPERTIES:
:CUSTOM_ID: pr355
:END:

See [[https://qt4cg.org/dashboard/#pr-355][pull request #355]].

ACTION QT4CG-025-06: NW to fix the “blue boxes” in the serialization specification

+ MK: Adds two implement-defined features

Proposal: Accept this PR?

Accepted.

