meeting/minutes/2023/03-07.html

<div id="outline-container-h-074E7C57-5C3A-4FA8-AF9E-EAFE0F504864" class="outline-3">
<h3 id="h-074E7C57-5C3A-4FA8-AF9E-EAFE0F504864"><span class="section-number-3">2.1.</span> PR #375: Context for default parameter values</h3>
<div class="outline-text-3" id="text-h-074E7C57-5C3A-4FA8-AF9E-EAFE0F504864">
<p>
Contrary to the remark above, this <i>is not</i> a small issue. But it’s a
bug and deseves high priority. I propose a 30 minute time box on this
issue so that we do have time to resolve some low hanging fruit.
</p>

<p>
See <a href="https://qt4cg.org/dashboard/#pr-375">pull request #375</a>.
</p>

<ul class="org-ul">
<li>MK: I worked through all the changes in XQuery, but haven’t done the
corresponding changes on XSLT. If we agree with the design, it’s
fairly mechanical to translate to XSLT.
<ul class="org-ul">
<li>… In the course of doing this, I found that the two sections on
variable and function declarations had become unstructured and
unweildy. I reorganized them but that makes the diff hard to read.</li>
<li>… What should be the static and dynamic context for the expression
that defines a default value?</li>
<li>… Using the same static context as variable declarations fails to
satisfy the goal of allowing user-defined functions to have access
to the context item and default collation.</li>
<li>… First thought was to use something different for the dynamic
context, but that makes the inconsistent. The “static item context
type” for example becomes meaningless if the context item is taken
from the dynamic context.</li>
<li>… I thought about defining a custom context, we could do that, but
it’s a little bit daunting.</li>
<li>… I also thought about cutting back on our ambitions and allowing
only the static context. That’d lose the ability to use the
context.</li>
<li>… The proposal here introduces a new function that you can call in
the initializing expression that give you access to parts of the
callers context.</li>
<li>… I’m not enormously fond of the solution, but…</li>
</ul></li>
<li>RD: As a goal, I think it’s a good to make it possible to get to the
dynamic context.</li>
<li>CG: I think that it would be good to add an example of a function
item. I outlined it in a comment on issue #375.</li>
</ul>

<pre class="example">
let $filter := function(
  $item := caller-context()?context-item()
) {
  $item = 'Jupiter'
}
return //planet[$filter()]
</pre>

<ul class="org-ul">
<li>MK: Adding examples is part of the next phase if the design is accepted.</li>
<li>CG: Can we call the function <code>context()</code> and the item <code>item</code>?</li>
<li>MK: When we get to talking about the spelling, you’re in the home stretch.</li>
<li>JL: Couldn’t this be generalized to solve questions like “what’s my
current mode” in XSLT?</li>
<li>MK: Yes. I adopted a fairly extensible design on purpose.</li>
<li>JL: Would we also have to be fairly careful about security
implications? About being able to see things that the compiler has
got rid of.</li>
<li>MK: For access to the static context, that could be an issue. It’s
nice to be able to discard parts of that.</li>
<li>RD: In the current spec, where we’ve done <code>.</code> for the context, all
of those will need updating.</li>
<li>MK: Yes, if we do this, we’ll have to update the standard functions.</li>
</ul>

<p>
MK isn’t sure that it makes sense to attempt to go through in too much
detail. Reviews the non-diff version because of the changes caused by
reorganizing things into subsections.
</p>

<ul class="org-ul">
<li>MK: Most of the change is in 5.18.1…</li>
<li>JL: Why are the record types functions rather than just values?</li>
<li>MK: Probably to emphasize that you expect them to be evaluated
lazily; that’s probably particularly true of <code>last()</code>.
<ul class="org-ul">
<li>… We could leave out the brackets and make them properties rather than
methods.</li>
</ul></li>
<li>CG: One advantage of a simple map is that it makes it clear that the
values you get are specific to when the function was called.</li>
<li>RD: I’m in favor of them being ordinary variables.</li>
</ul>

<p>
ACTION QT4CG-025-02: MK to make the context function properties simple values instead of functions
</p>

<ul class="org-ul">
<li>MK: I think we’re looking for agreement in principle.</li>
<li>CG: The <code>$</code> character needs to be removed</li>
<li>MK: Yes, that’s a typo.</li>
<li>JL: In XSLT, we have a parallel where it’s a variable (in catches
and things).</li>
<li>MK: Yes, we define magic variables there. There are other places
where we define magic functions.</li>
<li>RD: XQuery does the same thing for variables in the catch expression.</li>
<li>MK: If it’s a magic variable, what namespace does it have to be in?</li>
<li>NW: We can leave it a function and not have to answer that question!</li>
<li>CG: A function also makes it clear that it changes when called in different places.</li>
<li>JL: Can you bind it to a variable?</li>
<li>MK: Yes, but the scope is going to be in your initializer so it can’t escape.</li>
</ul>

<p>
Proposal: accept this PR in principle, action to MK to expand it
</p>

<p>
Accepted.
</p>

<p>
ACTION QT4CG-025-03: MK to revise and expand technical detail in PR #375
</p>
</div>
</div>

<div id="outline-container-h-7AC1783C-19E6-4163-8BE0-236FBABFE76E" class="outline-3">
<h3 id="h-7AC1783C-19E6-4163-8BE0-236FBABFE76E"><span class="section-number-3">2.2.</span> PR #378: Update the localName and unparsed entity reference notes for parse-html</h3>
<div class="outline-text-3" id="text-h-7AC1783C-19E6-4163-8BE0-236FBABFE76E">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-378">pull request #378</a>.
</p>

<ul class="org-ul">
<li>RD: This is a straightforward change; I’ve changed “must” to “will”
in various cases where we’re referring to ASCII lower case and
changed “unparsed” to “unknown”.</li>
</ul>

<p>
Some discussion of the “unparsed-entity-public-id” accessor. It’s not
relevant because HTML5 doesn’t have unparsed entities.
</p>

<p>
ACTION QT4CG-025-04: RD to remove the note in 15.5.15 of functions and operators.
</p>

<p>
Proposal: Accept as ammended?
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-h-EDC3E35B-2AD7-4E6F-B92D-4369CF84D8DC" class="outline-3">
<h3 id="h-EDC3E35B-2AD7-4E6F-B92D-4369CF84D8DC"><span class="section-number-3">2.3.</span> PR #371: Issue 370: forwards and backwards compatibility for 4.0</h3>
<div class="outline-text-3" id="text-h-EDC3E35B-2AD7-4E6F-B92D-4369CF84D8DC">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-371">pull request #371</a>.
</p>

<ul class="org-ul">
<li>MK: This was editorially updating some things to say 4.0 instead of 3.0.</li>
</ul>

<p>
Proposal: Accept this PR?
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr364" class="outline-3">
<h3 id="pr364"><span class="section-number-3">2.4.</span> PR #364: Generalize switch expressions in XQuery</h3>
<div class="outline-text-3" id="text-pr364">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-364">pull request #364</a>.
</p>

<ul class="org-ul">
<li>CG talks us through the changes to the switch expression.
<ul class="org-ul">
<li>… In the new version you can supply arbitrary lists of expressions
in the switch expressions. If any expression matches, then the
case is accepted. If it’s an empty expression it works as before.</li>
</ul></li>
</ul>

<p>
Proposal: Accept this PR?
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr363" class="outline-3">
<h3 id="pr363"><span class="section-number-3">2.5.</span> PR #363: Issue 345; missing rules for type matching</h3>
<div class="outline-text-3" id="text-pr363">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-363">pull request #363</a>.
</p>

<ul class="org-ul">
<li>MK: This was a fairly obvious omission. I’ve added a few notes and
clarified what schema types are.
<ul class="org-ul">
<li>… Local union type and enumeration types are “schema types”</li>
<li>… etc.</li>
</ul></li>
</ul>

<p>
ACTION QT4CG-025-05: MK to correct the accidental deletion in 3.6.2 of XQuery
</p>

<ul class="org-ul">
<li>MK: The new rule in 3.6.2 is what was missing.
<ul class="org-ul">
<li>… The rest is expanding on the definitions and editorial improvements.</li>
</ul></li>
</ul>

<p>
Proposal: Accept this PR as amended?
</p>

<p>
Accepted.
</p>
</div>
</div>


<div id="outline-container-pr355" class="outline-3">
<h3 id="pr355"><span class="section-number-3">2.6.</span> PR #355: Add to imp-defined-feature-appendix</h3>
<div class="outline-text-3" id="text-pr355">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-355">pull request #355</a>.
</p>

<p>
ACTION QT4CG-025-06: NW to fix the “blue boxes” in the serialization specification
</p>

<ul class="org-ul">
<li>MK: Adds two implement-defined features</li>
</ul>

<p>
Proposal: Accept this PR?
</p>

<p>
Accepted.
</p>
</div>
</div>
