meeting/minutes/2023/03-07.org
** PR #344: Issue 22: allow "for"/"let" keyword to be repeated in XPath
:PROPERTIES:
:CUSTOM_ID: h-751A3ADC-981F-4AB4-BFE4-523B8CD342C7
:END:

See [[https://qt4cg.org/dashboard/#pr-344][pull request #344]].

+ MK: This one is a little bit more substantial.
  + … Tidies up the language about iterating in 4.12
  + … Slightly refactors the syntax but essentially let’s you have two
    =for= clauses. It’s syntactic sugar to let you write expressions
    in XPath that look more like XQuery.
+ MSM: The refactoring of SimpleForBinding seems to make a grammatical
  change is that intended?
  + … If I’m reading the grammar correctly, in the old grammar the keyword member is
    optional before the first keyword binding in a for, but not in one following a comma.
    Now it is allowed in front of any variable binding.
+ MK: Yes, that’s correct. Now you can control =member= for each one
  independently.
+ RD: I created an issue ([[https://github.com/qt4cg/qtspecs/issues/49][#49]]) for this.
  + This goes into the discussion of the for-member functionality that
    was added before we convened as a group.
+ MK: Let’s check what the non-diff syntax looks like.
  + … The member keyword doesn’t propagate. If you say =member= your
    iterating over an array; otherwise you’re iterating over a
    sequence.

+ MK: The PR does the same thing for =let=.
+ JL: We have an error case when its not an array and you use
  =member=. I didn’t see an error code.

ACTION QT4CG-025-07: MK to update the text about for/let changes to use use definitions and termrefs correctly.
ACTION QT4CG-025-08: MK to add an error code for the case where =member= is used on something that isn’t an array

Proposal: Accept this PR?

Accepted.

** PR #347: Attempt to clarify fn:parse-uri and fn:build-uri
:PROPERTIES:
:CUSTOM_ID: h-9AF44047-B476-419D-A158-13D6BD879D4C
:END:

See [[https://qt4cg.org/dashboard/#pr-347][pull request #347]].

+ NW walks through the changes.

ACTION QT4CG-025-09: NW to add the parse-uri and build-uri tests to the test suite

Proposal: Accept this PR?

Accepted.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

None heard.
