meeting/minutes/2023/03-07.html

<div id="outline-container-h-751A3ADC-981F-4AB4-BFE4-523B8CD342C7" class="outline-3">
<h3 id="h-751A3ADC-981F-4AB4-BFE4-523B8CD342C7"><span class="section-number-3">2.7.</span> PR #344: Issue 22: allow "for"/"let" keyword to be repeated in XPath</h3>
<div class="outline-text-3" id="text-h-751A3ADC-981F-4AB4-BFE4-523B8CD342C7">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-344">pull request #344</a>.
</p>

<ul class="org-ul">
<li>MK: This one is a little bit more substantial.
<ul class="org-ul">
<li>… Tidies up the language about iterating in 4.12</li>
<li>… Slightly refactors the syntax but essentially let’s you have two
<code>for</code> clauses. It’s syntactic sugar to let you write expressions
in XPath that look more like XQuery.</li>
</ul></li>
<li>MSM: The refactoring of SimpleForBinding seems to make a grammatical
change is that intended?
<ul class="org-ul">
<li>… If I’m reading the grammar correctly, in the old grammar the keyword member is
optional before the first keyword binding in a for, but not in one following a comma.
Now it is allowed in front of any variable binding.</li>
</ul></li>
<li>MK: Yes, that’s correct. Now you can control <code>member</code> for each one
independently.</li>
<li>RD: I created an issue (<a href="https://github.com/qt4cg/qtspecs/issues/49">#49</a>) for this.
<ul class="org-ul">
<li>This goes into the discussion of the for-member functionality that
was added before we convened as a group.</li>
</ul></li>
<li>MK: Let’s check what the non-diff syntax looks like.
<ul class="org-ul">
<li>… The member keyword doesn’t propagate. If you say <code>member</code> your
iterating over an array; otherwise you’re iterating over a
sequence.</li>
</ul></li>

<li>MK: The PR does the same thing for <code>let</code>.</li>
<li>JL: We have an error case when its not an array and you use
<code>member</code>. I didn’t see an error code.</li>
</ul>

<p>
ACTION QT4CG-025-07: MK to update the text about for/let changes to use use definitions and termrefs correctly.
ACTION QT4CG-025-08: MK to add an error code for the case where <code>member</code> is used on something that isn’t an array
</p>

<p>
Proposal: Accept this PR?
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-h-9AF44047-B476-419D-A158-13D6BD879D4C" class="outline-3">
<h3 id="h-9AF44047-B476-419D-A158-13D6BD879D4C"><span class="section-number-3">2.8.</span> PR #347: Attempt to clarify fn:parse-uri and fn:build-uri</h3>
<div class="outline-text-3" id="text-h-9AF44047-B476-419D-A158-13D6BD879D4C">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-347">pull request #347</a>.
</p>

<ul class="org-ul">
<li>NW walks through the changes.</li>
</ul>

<p>
ACTION QT4CG-025-09: NW to add the parse-uri and build-uri tests to the test suite
</p>

<p>
Proposal: Accept this PR?
</p>

<p>
Accepted.
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>
</div>
</body>
</html>
